package TestDataGenerator;

import java.util.concurrent.ThreadLocalRandom;

public class NameGenerator {
    private static final String firstLexicon = "김이박최정강조윤장임한오서신권황안송전홍유고문양손배조백허유남심노정하곽성차주우구신임전민유류나";
    private static final String[] secondLexicon = new String[] {
            "민준","서준","예준","도윤","주원","시우","지후","지호","준서","하준","현우","준우","지훈","도현","건우","우진","현준","민재","선우","서진","연우","정우","유준","승현","준혁","승우","지환","승민","시윤","민성","지우","유찬","준영","진우","시후","지원","은우","수현","윤우","동현","재윤","민규","시현","태윤","재원","민우","재민","은찬","한결","윤호","민찬","시원","성민","성현","준호","승준","수호","현서","재현","지성","시온","태민","태현","민혁","예성","민호","하율","성준","우빈","지안","지율","정민","규민","윤성","민석","지한","지민","준","준수","이준","서우","은호","은성","예찬","윤재","이안","율","하람","태양","준희","준성","하진","현수","도훈","승원","정현","건","지완","강민","승호","서연","서윤","지우","서현","민서","하은","하윤","윤서","지민","지유","채원","지윤","은서","수아","다은","예은","수빈","예원","지아","소율","지원","예린","소윤","유진","시은","채은","가은","서영","민지","지안","윤아","하린","예진","수민","유나","수연","연우","시연","예서","예나","주아","연서","현서","서아","다연","하율","다인","아인","서진","서은","유빈","수현","하연","채윤","예지","서율","지율","유주","서우","시아","나윤","다현","민주","지은","윤지","아린","나연","시현","예빈","지현","소연","소은","사랑","혜원","지수","은채","주하","서하","승아","나은","서희","나현","민아","아윤","세은","채린","하영","소민","도연","다윤","아영","규리","채아","지연","예림","가윤","태희","세아","민채","유정"
    };

    public static String generateRandomName() {
        ThreadLocalRandom rand = ThreadLocalRandom.current();
        return firstLexicon.charAt(rand.nextInt(firstLexicon.length()))
                + secondLexicon[rand.nextInt(secondLexicon.length)];
    }
}
